zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc01/include/pio/pic32ck1012gc01100.h
#define PIN_PD07D_SERCOM1_PAD3                     _UINT32_(103)
#define MUX_PD07D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PD07D_SERCOM1_PAD3                  ((PIN_PD07D_SERCOM1_PAD3 << 16) | MUX_PD07D_SERCOM1_PAD3)
#define PORT_PD07D_SERCOM1_PAD3                    (_UINT32_(1) << 7)

#define PIN_PD11C_SERCOM1_PAD3                     _UINT32_(107)
#define MUX_PD11C_SERCOM1_PAD3                     _UINT32_(2) 
#define PINMUX_PD11C_SERCOM1_PAD3                  ((PIN_PD11C_SERCOM1_PAD3 << 16) | MUX_PD11C_SERCOM1_PAD3)
#define PORT_PD11C_SERCOM1_PAD3                    (_UINT32_(1) << 11)

/* ================= PORT definition for SERCOM2 peripheral ================= */
#define PIN_PC11D_SERCOM2_PAD0                     _UINT32_(75)
#define MUX_PC11D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PC11D_SERCOM2_PAD0                  ((PIN_PC11D_SERCOM2_PAD0 << 16) | MUX_PC11D_SERCOM2_PAD0)
#define PORT_PC11D_SERCOM2_PAD0                    (_UINT32_(1) << 11)

#define PIN_PC06C_SERCOM2_PAD0                     _UINT32_(70)
#define MUX_PC06C_SERCOM2_PAD0                     _UINT32_(2) 
#define PINMUX_PC06C_SERCOM2_PAD0                  ((PIN_PC06C_SERCOM2_PAD0 << 16) | MUX_PC06C_SERCOM2_PAD0)
#define PORT_PC06C_SERCOM2_PAD0                    (_UINT32_(1) << 6)

#define PIN_PC15C_SERCOM2_PAD0                     _UINT32_(79)
#define MUX_PC15C_SERCOM2_PAD0                     _UINT32_(2) 
#define PINMUX_PC15C_SERCOM2_PAD0                  ((PIN_PC15C_SERCOM2_PAD0 << 16) | MUX_PC15C_SERCOM2_PAD0)
#define PORT_PC15C_SERCOM2_PAD0                    (_UINT32_(1) << 15)

#define PIN_PC10D_SERCOM2_PAD1                     _UINT32_(74)
#define MUX_PC10D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PC10D_SERCOM2_PAD1                  ((PIN_PC10D_SERCOM2_PAD1 << 16) | MUX_PC10D_SERCOM2_PAD1)
#define PORT_PC10D_SERCOM2_PAD1                    (_UINT32_(1) << 10)

#define PIN_PC07C_SERCOM2_PAD1                     _UINT32_(71)
#define MUX_PC07C_SERCOM2_PAD1                     _UINT32_(2) 
#define PINMUX_PC07C_SERCOM2_PAD1                  ((PIN_PC07C_SERCOM2_PAD1 << 16) | MUX_PC07C_SERCOM2_PAD1)
#define PORT_PC07C_SERCOM2_PAD1                    (_UINT32_(1) << 7)

#define PIN_PC16C_SERCOM2_PAD1                     _UINT32_(80)
#define MUX_PC16C_SERCOM2_PAD1                     _UINT32_(2) 
#define PINMUX_PC16C_SERCOM2_PAD1                  ((PIN_PC16C_SERCOM2_PAD1 << 16) | MUX_PC16C_SERCOM2_PAD1)
#define PORT_PC16C_SERCOM2_PAD1                    (_UINT32_(1) << 16)

#define PIN_PC05D_SERCOM2_PAD2                     _UINT32_(69)
#define MUX_PC05D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PC05D_SERCOM2_PAD2                  ((PIN_PC05D_SERCOM2_PAD2 << 16) | MUX_PC05D_SERCOM2_PAD2)
#define PORT_PC05D_SERCOM2_PAD2                    (_UINT32_(1) << 5)

#define PIN_PC12D_SERCOM2_PAD2                     _UINT32_(76)
#define MUX_PC12D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PC12D_SERCOM2_PAD2                  ((PIN_PC12D_SERCOM2_PAD2 << 16) | MUX_PC12D_SERCOM2_PAD2)
#define PORT_PC12D_SERCOM2_PAD2                    (_UINT32_(1) << 12)

#define PIN_PC09C_SERCOM2_PAD2                     _UINT32_(73)
#define MUX_PC09C_SERCOM2_PAD2                     _UINT32_(2) 
#define PINMUX_PC09C_SERCOM2_PAD2                  ((PIN_PC09C_SERCOM2_PAD2 << 16) | MUX_PC09C_SERCOM2_PAD2)
#define PORT_PC09C_SERCOM2_PAD2                    (_UINT32_(1) << 9)

#define PIN_PC17C_SERCOM2_PAD2                     _UINT32_(81)
#define MUX_PC17C_SERCOM2_PAD2                     _UINT32_(2) 
#define PINMUX_PC17C_SERCOM2_PAD2                  ((PIN_PC17C_SERCOM2_PAD2 << 16) | MUX_PC17C_SERCOM2_PAD2)
#define PORT_PC17C_SERCOM2_PAD2                    (_UINT32_(1) << 17)

#define PIN_PC02D_SERCOM2_PAD3                     _UINT32_(66)
#define MUX_PC02D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PC02D_SERCOM2_PAD3                  ((PIN_PC02D_SERCOM2_PAD3 << 16) | MUX_PC02D_SERCOM2_PAD3)
#define PORT_PC02D_SERCOM2_PAD3                    (_UINT32_(1) << 2)

#define PIN_PC13D_SERCOM2_PAD3                     _UINT32_(77)
#define MUX_PC13D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PC13D_SERCOM2_PAD3                  ((PIN_PC13D_SERCOM2_PAD3 << 16) | MUX_PC13D_SERCOM2_PAD3)
#define PORT_PC13D_SERCOM2_PAD3                    (_UINT32_(1) << 13)

#define PIN_PC14C_SERCOM2_PAD3                     _UINT32_(78)
#define MUX_PC14C_SERCOM2_PAD3                     _UINT32_(2) 
#define PINMUX_PC14C_SERCOM2_PAD3                  ((PIN_PC14C_SERCOM2_PAD3 << 16) | MUX_PC14C_SERCOM2_PAD3)
#define PORT_PC14C_SERCOM2_PAD3                    (_UINT32_(1) << 14)

#define PIN_PC18C_SERCOM2_PAD3                     _UINT32_(82)
#define MUX_PC18C_SERCOM2_PAD3                     _UINT32_(2) 
#define PINMUX_PC18C_SERCOM2_PAD3                  ((PIN_PC18C_SERCOM2_PAD3 << 16) | MUX_PC18C_SERCOM2_PAD3)
#define PORT_PC18C_SERCOM2_PAD3                    (_UINT32_(1) << 18)

/* ================= PORT definition for SERCOM3 peripheral ================= */
#define PIN_PC07D_SERCOM3_PAD0                     _UINT32_(71)
#define MUX_PC07D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PC07D_SERCOM3_PAD0                  ((PIN_PC07D_SERCOM3_PAD0 << 16) | MUX_PC07D_SERCOM3_PAD0)
#define PORT_PC07D_SERCOM3_PAD0                    (_UINT32_(1) << 7)

#define PIN_PB16C_SERCOM3_PAD0                     _UINT32_(48)
#define MUX_PB16C_SERCOM3_PAD0                     _UINT32_(2) 
#define PINMUX_PB16C_SERCOM3_PAD0                  ((PIN_PB16C_SERCOM3_PAD0 << 16) | MUX_PB16C_SERCOM3_PAD0)
#define PORT_PB16C_SERCOM3_PAD0                    (_UINT32_(1) << 16)

#define PIN_PC02C_SERCOM3_PAD0                     _UINT32_(66)
#define MUX_PC02C_SERCOM3_PAD0                     _UINT32_(2) 
#define PINMUX_PC02C_SERCOM3_PAD0                  ((PIN_PC02C_SERCOM3_PAD0 << 16) | MUX_PC02C_SERCOM3_PAD0)
#define PORT_PC02C_SERCOM3_PAD0                    (_UINT32_(1) << 2)

