zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc01/include/pio/pic32ck1012gc01100.h
#define PIN_PC00G_TCC0_WO1                         _UINT32_(64)
#define MUX_PC00G_TCC0_WO1                         _UINT32_(6) 
#define PINMUX_PC00G_TCC0_WO1                      ((PIN_PC00G_TCC0_WO1 << 16) | MUX_PC00G_TCC0_WO1)
#define PORT_PC00G_TCC0_WO1                        (_UINT32_(1) << 0)

#define PIN_PB05F_TCC0_WO1                         _UINT32_(37)
#define MUX_PB05F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PB05F_TCC0_WO1                      ((PIN_PB05F_TCC0_WO1 << 16) | MUX_PB05F_TCC0_WO1)
#define PORT_PB05F_TCC0_WO1                        (_UINT32_(1) << 5)

#define PIN_PC01G_TCC0_WO2                         _UINT32_(65)
#define MUX_PC01G_TCC0_WO2                         _UINT32_(6) 
#define PINMUX_PC01G_TCC0_WO2                      ((PIN_PC01G_TCC0_WO2 << 16) | MUX_PC01G_TCC0_WO2)
#define PORT_PC01G_TCC0_WO2                        (_UINT32_(1) << 1)

#define PIN_PB13F_TCC0_WO2                         _UINT32_(45)
#define MUX_PB13F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PB13F_TCC0_WO2                      ((PIN_PB13F_TCC0_WO2 << 16) | MUX_PB13F_TCC0_WO2)
#define PORT_PB13F_TCC0_WO2                        (_UINT32_(1) << 13)

#define PIN_PC02G_TCC0_WO3                         _UINT32_(66)
#define MUX_PC02G_TCC0_WO3                         _UINT32_(6) 
#define PINMUX_PC02G_TCC0_WO3                      ((PIN_PC02G_TCC0_WO3 << 16) | MUX_PC02G_TCC0_WO3)
#define PORT_PC02G_TCC0_WO3                        (_UINT32_(1) << 2)

#define PIN_PB06F_TCC0_WO3                         _UINT32_(38)
#define MUX_PB06F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PB06F_TCC0_WO3                      ((PIN_PB06F_TCC0_WO3 << 16) | MUX_PB06F_TCC0_WO3)
#define PORT_PB06F_TCC0_WO3                        (_UINT32_(1) << 6)

#define PIN_PC03G_TCC0_WO4                         _UINT32_(67)
#define MUX_PC03G_TCC0_WO4                         _UINT32_(6) 
#define PINMUX_PC03G_TCC0_WO4                      ((PIN_PC03G_TCC0_WO4 << 16) | MUX_PC03G_TCC0_WO4)
#define PORT_PC03G_TCC0_WO4                        (_UINT32_(1) << 3)

#define PIN_PB14F_TCC0_WO4                         _UINT32_(46)
#define MUX_PB14F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PB14F_TCC0_WO4                      ((PIN_PB14F_TCC0_WO4 << 16) | MUX_PB14F_TCC0_WO4)
#define PORT_PB14F_TCC0_WO4                        (_UINT32_(1) << 14)

#define PIN_PC04G_TCC0_WO5                         _UINT32_(68)
#define MUX_PC04G_TCC0_WO5                         _UINT32_(6) 
#define PINMUX_PC04G_TCC0_WO5                      ((PIN_PC04G_TCC0_WO5 << 16) | MUX_PC04G_TCC0_WO5)
#define PORT_PC04G_TCC0_WO5                        (_UINT32_(1) << 4)

#define PIN_PB15F_TCC0_WO5                         _UINT32_(47)
#define MUX_PB15F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PB15F_TCC0_WO5                      ((PIN_PB15F_TCC0_WO5 << 16) | MUX_PB15F_TCC0_WO5)
#define PORT_PB15F_TCC0_WO5                        (_UINT32_(1) << 15)

/* ================== PORT definition for TCC1 peripheral =================== */
#define PIN_PC05G_TCC1_WO0                         _UINT32_(69)
#define MUX_PC05G_TCC1_WO0                         _UINT32_(6) 
#define PINMUX_PC05G_TCC1_WO0                      ((PIN_PC05G_TCC1_WO0 << 16) | MUX_PC05G_TCC1_WO0)
#define PORT_PC05G_TCC1_WO0                        (_UINT32_(1) << 5)

#define PIN_PC15F_TCC1_WO0                         _UINT32_(79)
#define MUX_PC15F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PC15F_TCC1_WO0                      ((PIN_PC15F_TCC1_WO0 << 16) | MUX_PC15F_TCC1_WO0)
#define PORT_PC15F_TCC1_WO0                        (_UINT32_(1) << 15)

#define PIN_PC06G_TCC1_WO1                         _UINT32_(70)
#define MUX_PC06G_TCC1_WO1                         _UINT32_(6) 
#define PINMUX_PC06G_TCC1_WO1                      ((PIN_PC06G_TCC1_WO1 << 16) | MUX_PC06G_TCC1_WO1)
#define PORT_PC06G_TCC1_WO1                        (_UINT32_(1) << 6)

#define PIN_PC16F_TCC1_WO1                         _UINT32_(80)
#define MUX_PC16F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PC16F_TCC1_WO1                      ((PIN_PC16F_TCC1_WO1 << 16) | MUX_PC16F_TCC1_WO1)
#define PORT_PC16F_TCC1_WO1                        (_UINT32_(1) << 16)

#define PIN_PC07G_TCC1_WO2                         _UINT32_(71)
#define MUX_PC07G_TCC1_WO2                         _UINT32_(6) 
#define PINMUX_PC07G_TCC1_WO2                      ((PIN_PC07G_TCC1_WO2 << 16) | MUX_PC07G_TCC1_WO2)
#define PORT_PC07G_TCC1_WO2                        (_UINT32_(1) << 7)

#define PIN_PC17F_TCC1_WO2                         _UINT32_(81)
#define MUX_PC17F_TCC1_WO2                         _UINT32_(5) 
#define PINMUX_PC17F_TCC1_WO2                      ((PIN_PC17F_TCC1_WO2 << 16) | MUX_PC17F_TCC1_WO2)
#define PORT_PC17F_TCC1_WO2                        (_UINT32_(1) << 17)

#define PIN_PC09G_TCC1_WO3                         _UINT32_(73)
#define MUX_PC09G_TCC1_WO3                         _UINT32_(6) 
#define PINMUX_PC09G_TCC1_WO3                      ((PIN_PC09G_TCC1_WO3 << 16) | MUX_PC09G_TCC1_WO3)
#define PORT_PC09G_TCC1_WO3                        (_UINT32_(1) << 9)

#define PIN_PC18F_TCC1_WO3                         _UINT32_(82)
#define MUX_PC18F_TCC1_WO3                         _UINT32_(5) 
#define PINMUX_PC18F_TCC1_WO3                      ((PIN_PC18F_TCC1_WO3 << 16) | MUX_PC18F_TCC1_WO3)
#define PORT_PC18F_TCC1_WO3                        (_UINT32_(1) << 18)

#define PIN_PC15G_TCC1_WO4                         _UINT32_(79)
#define MUX_PC15G_TCC1_WO4                         _UINT32_(6) 
#define PINMUX_PC15G_TCC1_WO4                      ((PIN_PC15G_TCC1_WO4 << 16) | MUX_PC15G_TCC1_WO4)
#define PORT_PC15G_TCC1_WO4                        (_UINT32_(1) << 15)

#define PIN_PC19F_TCC1_WO4                         _UINT32_(83)
#define MUX_PC19F_TCC1_WO4                         _UINT32_(5) 
#define PINMUX_PC19F_TCC1_WO4                      ((PIN_PC19F_TCC1_WO4 << 16) | MUX_PC19F_TCC1_WO4)
#define PORT_PC19F_TCC1_WO4                        (_UINT32_(1) << 19)

#define PIN_PC10G_TCC1_WO5                         _UINT32_(74)
#define MUX_PC10G_TCC1_WO5                         _UINT32_(6) 
#define PINMUX_PC10G_TCC1_WO5                      ((PIN_PC10G_TCC1_WO5 << 16) | MUX_PC10G_TCC1_WO5)
#define PORT_PC10G_TCC1_WO5                        (_UINT32_(1) << 10)

#define PIN_PC20F_TCC1_WO5                         _UINT32_(84)
#define MUX_PC20F_TCC1_WO5                         _UINT32_(5) 
#define PINMUX_PC20F_TCC1_WO5                      ((PIN_PC20F_TCC1_WO5 << 16) | MUX_PC20F_TCC1_WO5)
#define PORT_PC20F_TCC1_WO5                        (_UINT32_(1) << 20)

#define PIN_PC11G_TCC1_WO6                         _UINT32_(75)
#define MUX_PC11G_TCC1_WO6                         _UINT32_(6) 
#define PINMUX_PC11G_TCC1_WO6                      ((PIN_PC11G_TCC1_WO6 << 16) | MUX_PC11G_TCC1_WO6)
#define PORT_PC11G_TCC1_WO6                        (_UINT32_(1) << 11)

#define PIN_PC12G_TCC1_WO7                         _UINT32_(76)
#define MUX_PC12G_TCC1_WO7                         _UINT32_(6) 
#define PINMUX_PC12G_TCC1_WO7                      ((PIN_PC12G_TCC1_WO7 << 16) | MUX_PC12G_TCC1_WO7)
#define PORT_PC12G_TCC1_WO7                        (_UINT32_(1) << 12)

/* ================== PORT definition for TCC2 peripheral =================== */
#define PIN_PD05G_TCC2_WO0                         _UINT32_(101)
#define MUX_PD05G_TCC2_WO0                         _UINT32_(6) 
#define PINMUX_PD05G_TCC2_WO0                      ((PIN_PD05G_TCC2_WO0 << 16) | MUX_PD05G_TCC2_WO0)
#define PORT_PD05G_TCC2_WO0                        (_UINT32_(1) << 5)

#define PIN_PA00F_TCC2_WO0                         _UINT32_(0) 
#define MUX_PA00F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PA00F_TCC2_WO0                      ((PIN_PA00F_TCC2_WO0 << 16) | MUX_PA00F_TCC2_WO0)
#define PORT_PA00F_TCC2_WO0                        (_UINT32_(1) << 0)

#define PIN_PD06G_TCC2_WO1                         _UINT32_(102)
#define MUX_PD06G_TCC2_WO1                         _UINT32_(6) 
#define PINMUX_PD06G_TCC2_WO1                      ((PIN_PD06G_TCC2_WO1 << 16) | MUX_PD06G_TCC2_WO1)
#define PORT_PD06G_TCC2_WO1                        (_UINT32_(1) << 6)

#define PIN_PC11F_TCC2_WO1                         _UINT32_(75)
#define MUX_PC11F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PC11F_TCC2_WO1                      ((PIN_PC11F_TCC2_WO1 << 16) | MUX_PC11F_TCC2_WO1)
#define PORT_PC11F_TCC2_WO1                        (_UINT32_(1) << 11)

#define PIN_PD12F_TCC2_WO1                         _UINT32_(108)
#define MUX_PD12F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PD12F_TCC2_WO1                      ((PIN_PD12F_TCC2_WO1 << 16) | MUX_PD12F_TCC2_WO1)
#define PORT_PD12F_TCC2_WO1                        (_UINT32_(1) << 12)

#define PIN_PD07G_TCC2_WO2                         _UINT32_(103)
#define MUX_PD07G_TCC2_WO2                         _UINT32_(6) 
#define PINMUX_PD07G_TCC2_WO2                      ((PIN_PD07G_TCC2_WO2 << 16) | MUX_PD07G_TCC2_WO2)
#define PORT_PD07G_TCC2_WO2                        (_UINT32_(1) << 7)

#define PIN_PC10F_TCC2_WO2                         _UINT32_(74)
#define MUX_PC10F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PC10F_TCC2_WO2                      ((PIN_PC10F_TCC2_WO2 << 16) | MUX_PC10F_TCC2_WO2)
#define PORT_PC10F_TCC2_WO2                        (_UINT32_(1) << 10)

#define PIN_PD11F_TCC2_WO2                         _UINT32_(107)
#define MUX_PD11F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PD11F_TCC2_WO2                      ((PIN_PD11F_TCC2_WO2 << 16) | MUX_PD11F_TCC2_WO2)
#define PORT_PD11F_TCC2_WO2                        (_UINT32_(1) << 11)

